## Introduction to Pandas dataframes

### Introduction

When working with datasets, often one of the first things we may want to do is reduce the size of the data.  Or we may want to segment the data.  Now with a tool like pandas, we have a lot of tools for gathering data, but once we gather that data, how do we scope it down to a selection that is more manageable?  That's what we'll learn in this section.

### Gathering our data

In [3]:
import pandas as pd
movies_df = pd.read_csv('https://raw.githubusercontent.com/fivethirtyeight/data/master/bechdel/movies.csv')

What we have just created is called a pandas dataframe.

In [4]:
type(movies_df)

pandas.core.frame.DataFrame

Now a pandas dataframe is essentially a table of data, and we can view the first few rows of the data frame just like we would a list.

In [5]:
movies_df[:3]

,year,imdb,title,test,clean_test,binary,budget,domgross,intgross,code,budget_2013$,domgross_2013$,intgross_2013$,period code,decade code
0,2013,tt1711425,21 &amp; Over,notalk,notalk,FAIL,13000000,25682380.0,42195766.0,2013FAIL,13000000,25682380.0,42195766.0,1.0,1.0
1,2012,tt1343727,Dredd 3D,ok-disagree,ok,PASS,45000000,13414714.0,40868994.0,2012PASS,45658735,13611086.0,41467257.0,1.0,1.0
2,2013,tt2024544,12 Years a Slave,notalk-disagree,notalk,FAIL,20000000,53107035.0,158607035.0,2013FAIL,20000000,53107035.0,158607035.0,1.0,1.0

Just like every other table, we can think of our dataframe as consisting of rows and columns.

A dataframe is like a nested data structure in Python, like a list of dictionaries where each row is a list.  And we can even convert our dataframe into a list of dictionaries like so:

In [25]:
movie_records = movies_df.to_dict('records')
movie_records[:2]

[{'year': 2013,
  'imdb': 'tt1711425',
  'title': '21 &amp; Over',
  'test': 'notalk',
  'clean_test': 'notalk',
  'binary': 'FAIL',
  'budget': 13000000,
  'domgross': 25682380.0,
  'intgross': 42195766.0,
  'code': '2013FAIL',
  'budget_2013$': 13000000,
  'domgross_2013$': 25682380.0,
  'intgross_2013$': 42195766.0,
  'period code': 1.0,
  'decade code': 1.0},
 {'year': 2012,
  'imdb': 'tt1343727',
  'title': 'Dredd 3D',
  'test': 'ok-disagree',
  'clean_test': 'ok',
  'binary': 'PASS',
  'budget': 45000000,
  'domgross': 13414714.0,
  'intgross': 40868994.0,
  'code': '2012PASS',
  'budget_2013$': 45658735,
  'domgross_2013$': 13611086.0,
  'intgross_2013$': 41467257.0,
  'period code': 1.0,
  'decade code': 1.0}]

Or we can think of our dataframe like a list of lists, which we get if we call `to_numpy` (technically we get a array of numpy arrays).

In [26]:
movies_df.to_numpy()

array([[2013, 'tt1711425', '21 &amp; Over', ..., 42195766.0, 1.0, 1.0],
       [2012, 'tt1343727', 'Dredd 3D', ..., 41467257.0, 1.0, 1.0],
       [2013, 'tt2024544', '12 Years a Slave', ..., 158607035.0, 1.0,
        1.0],
       ...,
       [1971, 'tt0067116', 'The French Connection', ..., 236848653.0,
        nan, nan],
       [1971, 'tt0067992', 'Willy Wonka &amp; the Chocolate Factory',
        ..., 23018057.0, nan, nan],
       [1970, 'tt0065466', 'Beyond the Valley of the Dolls', ...,
        53978683.0, nan, nan]], dtype=object)

But either way, a nice way to think about a dataframe is as a nested data structure.

### Working with a series

Let's start with selecting a column from our dataframe.

In [23]:
year_ser = movies_df['year']
year_ser[:2]

0    2013
1    2012
Name: year, dtype: int64

Above, we select the first column, `year` and then we select the first two elements from year.  Let's see what this column is.

In [24]:
type(year_ser)

pandas.core.series.Series

So this is a different data structure, and it's called a series.  Essentially, a series is more like a list in Python.  And again we can see this.

In [29]:
year_ser.to_list()[:2]

[2013, 2012]

Above we have a Python list.

So we can think of a dataframe as a nested data structure in Python and a series as a Python list.

### The index

Let's take another look at our dataframe.

In [52]:
movies_df[:2]

,year,imdb,title,test,clean_test,binary,budget,domgross,intgross,code,budget_2013$,domgross_2013$,intgross_2013$,period_code,decade_code
0,2013,tt1711425,21 &amp; Over,notalk,notalk,FAIL,13000000,25682380.0,42195766.0,2013FAIL,13000000,25682380.0,42195766.0,1.0,1.0
1,2012,tt1343727,Dredd 3D,ok-disagree,ok,PASS,45000000,13414714.0,40868994.0,2012PASS,45658735,13611086.0,41467257.0,1.0,1.0

Those numbers of `0` and `1` are part of the index series.  Let's take a look at the index of `movies_df`.

In [51]:
movies_df.index

RangeIndex(start=0, stop=1794, step=1)

An index is a series, and so is essentially a list that identifies each row in the table.  The only rules we really have for the index is that all of the elements are unique and that they are the same as the number of rows.  We can change the index if we like.

In [54]:
movies_df.index = list(range(3, len(movies_df) + 3))

In [55]:
movies_df[:2]

,year,imdb,title,test,clean_test,binary,budget,domgross,intgross,code,budget_2013$,domgross_2013$,intgross_2013$,period_code,decade_code
3,2013,tt1711425,21 &amp; Over,notalk,notalk,FAIL,13000000,25682380.0,42195766.0,2013FAIL,13000000,25682380.0,42195766.0,1.0,1.0
4,2012,tt1343727,Dredd 3D,ok-disagree,ok,PASS,45000000,13414714.0,40868994.0,2012PASS,45658735,13611086.0,41467257.0,1.0,1.0

Oftentimes, we'll just leave the index as is, but sometimes it's nice to have the index match certain numbers, like the database ids.

### Summary

In this lesson, we were introduced to the dataframe and the series.  We saw that we can think of a dataframe as a table, or a nested data structure in Python.  And we can think of a series as a Python list.

# Coercing Data

### Introduction

When we gather data from the Internet, our data can be in multiple different formats.  Oftentimes our data will be in the form of text.  This is problematic because our data could represent a number, a category, or a date.  In this lesson, we'll see how we can convert our data.

### Exploring DataTypes

Let's take another look at our movies dataframe.

In [56]:
movies_df[:2]

,year,imdb,title,test,clean_test,binary,budget,domgross,intgross,code,budget_2013$,domgross_2013$,intgross_2013$,period_code,decade_code
3,2013,tt1711425,21 &amp; Over,notalk,notalk,FAIL,13000000,25682380.0,42195766.0,2013FAIL,13000000,25682380.0,42195766.0,1.0,1.0
4,2012,tt1343727,Dredd 3D,ok-disagree,ok,PASS,45000000,13414714.0,40868994.0,2012PASS,45658735,13611086.0,41467257.0,1.0,1.0

Now in pandas, each series must be of the same type.  So, for example, if we look at the datatype of the year series, we get the following.

In [58]:
movies_df['year'][:3]

3    2013
4    2012
5    2013
Name: year, dtype: int64

We can see at the bottom, that the `dtype` is `int64`.  In other words it's a 64 bit integer.  Now we can see the datatypes of the entire dataframe by calling `dtype` on our dataframe.

In [59]:
movies_df.dtypes

year                int64
imdb               object
title              object
test               object
clean_test         object
binary             object
budget              int64
domgross          float64
intgross          float64
code               object
budget_2013$        int64
domgross_2013$    float64
intgross_2013$    float64
period_code       float64
decade_code       float64
dtype: object

So here we can see the columns and the corresponding datatypes.  In general we want to change as many columns as possible from being type `object` as possible.  A series of type object is equivalent to the Python datatype of string.

In [60]:
movies_df['code'][:2]

3    2013FAIL
4    2012PASS
Name: code, dtype: object

So we can see that there is real data in the `code` category, but Pandas stores it as a type object.

We can find all of the columns that are of the object dtype with the following.

In [63]:
movie_objects_df = movies_df.select_dtypes('object')
movie_objects_df[:2]

        imdb          title         test clean_test binary      code
3  tt1711425  21 &amp; Over       notalk     notalk   FAIL  2013FAIL
4  tt1343727       Dredd 3D  ok-disagree         ok   PASS  2012PASS

From there, we could look to see if we can group some of this data by a number by looking at `value_counts`.  For example, let's look at the `value_counts` of binary.

In [79]:
movies_df['binary'].value_counts()

FAIL    991
PASS    803
Name: binary, dtype: int64

So we see that there are only two types of data.  We can replace this with a 1 or 0.

### Mapping booleans

Now a machine learning algorithm does not know how to interpret data as text.  We first need to change this data into numbers.  So let's learn some different ways to coerce our data in Python.

In [66]:
boolean_mapping = {'FAIL': False, 'PASS': True}

In [68]:
binary = movie_objects_df['binary'].map(boolean_mapping)

In [69]:
binary.dtype

dtype('bool')

We can see that this column is now a boolean.  That's as good as a number in Python.

In [71]:
1 == True and 0 == False

True

Now that we have this new series, let's replace our original series of text with this boolean series.

In [82]:
movies_with_binary = movies_df.copy()
movies_with_binary['binary'] = binary

In [84]:
movies_with_binary.dtypes

year                int64
imdb               object
title              object
test               object
clean_test         object
binary               bool
budget              int64
domgross          float64
intgross          float64
code               object
budget_2013$        int64
domgross_2013$    float64
intgross_2013$    float64
period_code       float64
decade_code       float64
dtype: object

So we can see that this one is now gone.

### Working with Categories

Let's look at the some of the columns that are remaining as objects.

In [85]:
remaining_movies_df = movies_with_binary.select_dtypes('object')
remaining_movies_df[:2]

        imdb          title         test clean_test      code
3  tt1711425  21 &amp; Over       notalk     notalk  2013FAIL
4  tt1343727       Dredd 3D  ok-disagree         ok  2012PASS

It looks like test and clean are similar to one another.

In [88]:
test_df = remaining_movies_df[['test', 'clean_test']]
test_df[:5]

              test clean_test
3           notalk     notalk
4      ok-disagree         ok
5  notalk-disagree     notalk
6           notalk     notalk
7              men        men

It looks like the data is largely the same, but that `test` captures a little bit more detailed data.

Once again, we can look at the value_counts.

In [89]:
test_df['test'].value_counts()

ok                  696
notalk              379
notalk-disagree     135
men                 125
ok-disagree         107
nowomen              88
dubious              81
men-disagree         69
dubious-disagree     61
nowomen-disagree     53
Name: test, dtype: int64

In [90]:
test_series = test_df['test'].astype('category')

In [91]:
test_series[:2]

3         notalk
4    ok-disagree
Name: test, dtype: category
Categories (10, object): [dubious, dubious-disagree, men, men-disagree, ..., nowomen, nowomen-disagree, ok, ok-disagree]

In [94]:
test_series.cat.categories

Index(['dubious', 'dubious-disagree', 'men', 'men-disagree', 'notalk',
       'notalk-disagree', 'nowomen', 'nowomen-disagree', 'ok', 'ok-disagree'],
      dtype='object')

In [103]:
movies_with_binary['test'] = test_series.cat.codes

In [105]:
movies_with_binary['clean_test'] = movies_with_binary['clean_test'].astype('category').cat.codes

In [108]:
movies_with_binary.select_dtypes(exclude = 'object').columns

Index(['year', 'test', 'clean_test', 'binary', 'budget', 'domgross',
       'intgross', 'budget_2013$', 'domgross_2013$', 'intgross_2013$',
       'period_code', 'decade_code'],
      dtype='object')

In [109]:
movies_with_binary.select_dtypes(include = 'object').columns

Index(['imdb', 'title', 'code'], dtype='object')

### Other conversions

* to numeric

Finally, if we see data that is close to numbers like we can convert it with the `to_numeric` method.

In [118]:
budget = movies_with_binary['budget'].map(str)

In [125]:
pd.to_numeric(budget).dtype

dtype('int64')

* to datetime